miniACS_V1_37/Linux/Tr69-Scripts/DiagPing.txt

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
<soap:Header>
<cwmp:ID soap:mustUnderstand="1">2</cwmp:ID>
</soap:Header>
<soap:Body>
<cwmp:SetParameterValues>
<ParameterList soap:arrayType="cwmp:ParameterValueStruct[5]">
<ParameterValueStruct>
<name>InternetGatewayDevice.IPPingDiagnostics.DiagnosticsState</name>
<value xsi:type="xsd:string">Requested</value>
</ParameterValueStruct>
<ParameterValueStruct>
<name>InternetGatewayDevice.IPPingDiagnostics.Host</name>
<value xsi:type="xsd:string">192.168.2.93</value>
</ParameterValueStruct>
<ParameterValueStruct>
<name>InternetGatewayDevice.IPPingDiagnostics.NumberOfRepetitions</name>
<value xsi:type="xsd:unsignedInt">30</value>
</ParameterValueStruct>
<ParameterValueStruct>
<name>InternetGatewayDevice.IPPingDiagnostics.DataBlockSize</name>
<value xsi:type="xsd:unsignedInt">200</value>
</ParameterValueStruct>
<ParameterValueStruct>
<name>InternetGatewayDevice.IPPingDiagnostics.Timeout</name>
<value xsi:type="xsd:unsignedInt">1000</value>
</ParameterValueStruct>
</ParameterList>
</cwmp:SetParameterValues>
</soap:Body>
</soap:Envelope>